In [1]:
import numpy as np
import pandas as pd

# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [2]:
df = pd.read_csv('df12.csv')
df

   A    B    C
0  1  444  abc
1  2  555  def
2  3  666  ghi
3  4  444  xyz

### Info on Unique Values

In [3]:
df['B'].unique()

array([444, 555, 666], dtype=int64)

#### No of Unique Value

In [4]:
len(df['B'].unique())

3

In [5]:
df['B'].nunique()

3

In [6]:
df['B'].value_counts()

444    2
555    1
666    1
Name: B, dtype: int64

### Data Selection

In [7]:
df['A']>2

0    False
1    False
2     True
3     True
Name: A, dtype: bool

In [8]:
df[df['A']>2 &]

   A    B    C
2  3  666  ghi
3  4  444  xyz

In [9]:
df[(df['A']>2) & (df['B']==444)]

   A    B    C
3  4  444  xyz

#### Custom Function-Use of .apply() method

In [10]:
def times2(x):
    return x*2

In [11]:
df['A'].apply(times2)

0    2
1    4
2    6
3    8
Name: A, dtype: int64

In [12]:
df['C'].apply(len)

0    3
1    3
2    3
3    3
Name: C, dtype: int64

In [13]:
df['A'].sum()

10

In [14]:
df.apply(times2)

   A     B       C
0  2   888  abcabc
1  4  1110  defdef
2  6  1332  ghighi
3  8   888  xyzxyz

In [15]:
### Permanently Removing a Column

In [16]:
del df['A']

In [17]:
df

     B    C
0  444  abc
1  555  def
2  666  ghi
3  444  xyz

### Sorting & Ordering

In [18]:
df

     B    C
0  444  abc
1  555  def
2  666  ghi
3  444  xyz

In [19]:
df.sort_values(by='B')

     B    C
0  444  abc
3  444  xyz
1  555  def
2  666  ghi

# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [20]:
df = pd.read_csv('df14.csv')

In [21]:
df

  Company  Person  Sales
0    GOOG     Ram     20
1    GOOG  Ramesh    120
2    MSFT   Shyam    340
3    MSFT   Kumar    124
4      FB    Rita    243
5      FB   Gopal    350

**Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

You can save this object as a new variable:

In [22]:
by_comp = df.groupby('Company')

And then call aggregate methods off the object:

In [23]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG      70.0
MSFT     232.0

In [24]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG      70.0
MSFT     232.0

In [25]:
df.groupby('Company').sum()

         Sales
Company
FB         593
GOOG       140
MSFT       464

In [26]:
df.groupby('Company').max()

         Person  Sales
Company
FB         Rita    350
GOOG     Ramesh    120
MSFT      Shyam    340

# Merging, Joining, and Concatenating

There are 3 main ways of combining DataFrames together: Merging, Joining and Concatenating. In this lecture we will discuss these 3 methods with examples.

In [27]:
df1 = pd.read_csv('df1.csv')

In [28]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [29]:
df2 = pd.read_csv('df2.csv')

In [30]:
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [31]:
df3 = pd.read_csv('df3.csv')

In [32]:
df3

     A    B    C    D
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

## Concatenation

Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use **pd.concat** and pass in a list of DataFrames to concatenate together:

In [33]:
df4 = pd.concat([df1,df2,df3])
df4

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1   C1   D1
2   A2   B2   C2   D2
3   A3   B3   C3   D3
0   A4   B4   C4   D4
1   A5   B5   C5   D5
2   A6   B6   C6   D6
3   A7   B7   C7   D7
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [34]:
df4.reset_index(inplace=True)
df4

    index    A    B    C    D
0       0   A0   B0   C0   D0
1       1   A1   B1   C1   D1
2       2   A2   B2   C2   D2
3       3   A3   B3   C3   D3
4       0   A4   B4   C4   D4
5       1   A5   B5   C5   D5
6       2   A6   B6   C6   D6
7       3   A7   B7   C7   D7
8       0   A8   B8   C8   D8
9       1   A9   B9   C9   D9
10      2  A10  B10  C10  D10
11      3  A11  B11  C11  D11

In [35]:
df4.drop('index',axis=1,inplace=True)

In [36]:
df4

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [37]:
df4 = pd.concat([df1,df2,df3],axis=1)
df4

    A   B   C   D   A   B   C   D    A    B    C    D
0  A0  B0  C0  D0  A4  B4  C4  D4   A8   B8   C8   D8
1  A1  B1  C1  D1  A5  B5  C5  D5   A9   B9   C9   D9
2  A2  B2  C2  D2  A6  B6  C6  D6  A10  B10  C10  D10
3  A3  B3  C3  D3  A7  B7  C7  D7  A11  B11  C11  D11

In [40]:
df4.columns

Index(['A', 'B', 'C', 'D', 'A', 'B', 'C', 'D', 'A', 'B', 'C', 'D'], dtype='object')

## Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [41]:
left = pd.DataFrame({'A':['A0','A1','A2'],
                     'B':['B0','B1','B2'],},
                       index=['K0','K1','K2'])
right = pd.DataFrame({'C':['C0','C1','C2'],
                     'D':['D0','D1','D2'],},
                       index=['K0','K2','K3'])

In [42]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [43]:
right

     C   D
K0  C0  D0
K2  C1  D1
K3  C2  D2

In [44]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

In [45]:
right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C1  D1   A2   B2
K3  C2  D2  NaN  NaN

In [46]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
                          'C': ['C0', 'C1', 'C2'],
                          'D': ['D0', 'D1', 'D2']})

## Merging

The **merge** function allows you to merge DataFrames together using a similar logic as merging SQL Tables together.

In [47]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [48]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2

In [49]:
pd.merge(left,right,how='inner')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2

In [50]:
pd.merge(left,right,how='outer')

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K2  A2  B2   C2   D2
3  K3  A3  B3  NaN  NaN

In [53]:
 df = pd.read_csv('population_india_census2011.csv',encoding='unicode_escape')

In [56]:
df.head(10)

,Sno,Region,State / Union Territory,Population,Rural population,Urban population,Area,Gender Ratio
0,1,North,Uttar Pradesh,199812341,155317278,44495063,"240,928 km2",912
1,2,West,Maharashtra,112374333,61556074,50818259,"307,713 km2",929
2,3,North,Bihar,104099452,92341436,11758016,"94,163 km2",918
3,4,East,West Bengal,91276115,62183113,29093002,"88,752 km2",953
4,5,Cntral,Madhya Pradesh,72626809,52557404,20069405,"308,245 km2",931
5,6,South,Tamil Nadu,72147030,37229590,34917440,"130,058 km2",996
6,7,North,Rajasthan,68548437,51500352,17048085,"342,239 km2",928
7,8,South,Karnataka,61095297,37469335,23625962,"191,791 km2",973
8,9,West,Gujarat,60439692,34694609,25745083,"196,024 km2",919
9,10,South,Andhra Pradesh,49577103,34966693,14610410,"162,968 km2",993

In [55]:
df.tail()

,Sno,Region,State / Union Territory,Population,Rural population,Urban population,Area,Gender Ratio
31,32,North,Chandigarh,1055450,28991,1026459,114 km2,818
32,33,West,Dadra and Nagar Haveli and Daman and Diu,585764,243510,342254,603 km2,711
33,34,South,Andaman and Nicobar Islands,380581,237093,143488,"8,249 km2",876
34,35,North,Ladakh,274000,43840,230160,"96,701 km2",853
35,36,South,Lakshadweep,64473,14141,50332,32 km2,946